{"inkVersion":21,"root":[[{"->":"chapter1"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"chapter1":["#","^narration","/#","#","^bg: Cafe","/#","^Evening. Lina, dressed modestly but neatly, carries a wrapped box. She pauses outside a café window, sees Daniel inside with Mira, laughing. Her heart leaps — at first with joy, then with confusion.","\n","#","^narration","/#","#","^bg: Cafe","/#","^Daniel’s here… good, my surprise will work perfectly. He doesn’t suspect a thing.","\n","#","^narration","/#","#","^bg: Cafe","/#","^She steps inside. The bell above the door jingles. She hears Mira’s voice, sharp with mockery.","\n","#","^speaker: Mira","/#","#","^protrait: Mira_mocking","/#","#","^bg: Cafe","/#","^Seriously, this is what she buys you? A joke. I wouldn’t even use it to hang my dog’s collar.","\n","#","^speaker: Daniel","/#","#","^protrait: Daniel_Snickering","/#","#","^bg: Cafe","/#","^Don’t laugh too loudly… She tries, but honestly, being with her feels like dragging around dead weight. Always tired, always plain. I deserve better.","\n","#","^narration","/#","#","^bg: Cafe","/#","^The words hit Lina like stones. Her grip tightens on the gift box. She steps forward, voice trembling but clear.","\n","#","^speaker: Lina","/#","#","^protrait: Lina_confrontational","/#","#","^bg: Cafe","/#","^Is that so, Daniel? …This is your idea of working late?","\n","#","^speaker: Daniel","/#","#","^protrait: Daniel_shocked","/#","#","^bg: Cafe","/#","^L-Lina?! You—what are you doing here?!","\n","#","^speaker: Mira","/#","#","^protrait: Mira_gleaming","/#","#","^bg: Cafe","/#","^Oh. So the charity case shows up. Perfect timing.","\n","#","^speaker: Lina","/#","#","^protrait: Lina_steady","/#","#","^bg: Cafe","/#","^Yes, it’s from me. A watch. Bought after months of cleaning shifts. Cheap, maybe. But at least I bought it with my own hands… not by clinging to someone else’s wallet.","\n","#","^speaker: Daniel","/#","#","^protrait: Daniel_flustered","/#","#","^bg: Cafe","/#","^Don’t start your drama here! You’re embarrassing me in front of everyone!","\n","#","^speaker: Mira","/#","#","^protrait: Mira_possessive","/#","#","^bg: Cafe","/#","^Embarrassing you? She’s embarrassing herself. Look at her clothes, her hair… She doesn’t belong in places like this.","\n","#","^speaker: Lina","/#","#","^protrait: Lina_breaking","/#","#","^bg: Cafe","/#","^I thought today mattered. I thought we mattered. But you know what? You’re right. I don’t belong here. Not with you.","\n","#","^narration","/#","#","^bg: Cafe","/#","^Silence. Customers glance their way. Mira, annoyed, grabs a cup of hot coffee and flicks it toward Lina. She gasps, trying to dodge, but the liquid splashes across her hand.","\n","#","^speaker: Lina","/#","#","^protrait: Lina_pain","/#","#","^bg: Cafe","/#","^Ahh—it burns!","\n","#","^speaker: Mira","/#","#","^protrait: Mira_cold","/#","#","^bg: Cafe","/#","^Ugly, clumsy, broke, and now even scarred. Who would ever want trash like you?","\n","#","^narration","/#","#","^bg: Street","/#","^Lina staggers back, face pale. She forces herself not to cry in front of them. She turns and stumbles out into the street, clutching her burned hand. Outside, Emma spots her and runs over.","\n","#","^speaker: Emma","/#","#","^protrait: Emma_concerned","/#","#","^bg: Street","/#","^Lina! What happened?! Your hand—oh my god, it’s red and blistering! Who did this?!","\n","#","^speaker: Lina","/#","#","^protrait: Lina_weak","/#","#","^bg: Street","/#","^…Maybe she was right, Emma. Maybe I really am… useless.","\n","#","^speaker: Emma","/#","#","^protrait: Emma_fierce","/#","#","^bg: Street","/#","^Don’t. Say. That. Not after everything you’ve done for him. You gave up your studies, you worked your fingers raw, you loved him more than he deserved. You’re not useless—he is.","\n","#","^speaker: Lina","/#","#","^protrait: Lina_whisper","/#","#","^bg: Street","/#","^…Then why does it hurt so much to hear them say it?","\n","#","^speaker: Emma","/#","#","^protrait: Emma_gentle","/#","#","^bg: Street","/#","^Because you cared. But now it’s time to stop caring about them and start caring about you. Come with me, Lina. Let me show you what I see when I look at you.","\n","#","^narration","/#","#","^bg: Street","/#","^Emma pulls Lina gently down the street, toward a boutique lit with warm golden lights.","\n","done",{"#f":1}],"#f":1}],"listDefs":{}}